In [34]:
import pandas as pd

In [35]:
sierra_fh = "files/GovDocs/private/GovDocs-Sierra-oclcNos.txt"
oclc_fh = "files/GovDocs/private/GovDocs-OCLC-oclcNos.txt"

In [36]:
sdf = pd.read_csv(sierra_fh, header=0, sep="\t", names=["oclcNo", "leader", "t008", "bibNo", "matType"], dtype={"oclcNo": str})

In [37]:
sdf.shape[0]

340218

In [38]:
odf = pd.read_csv(oclc_fh, header=0, sep="\t", names=["oclcNo", "leader", "t008"], dtype={"oclcNo": str})

In [39]:
odf.shape[0]

182631

In [40]:
df = pd.merge(sdf, odf, how="outer", on="oclcNo", indicator=True)

In [41]:
df.shape[0]

369830

In [42]:
df.head()

,oclcNo,leader_x,t008_x,bibNo,matType,leader_y,t008_y,_merge
0,100000459,02200cam a2200445Ka 4500,070329s2007\\\\wyu\\\\\o\\\\f000\0\eng\d,b165487732,w,02938cam a2200565 a 4500,070329s2007\\\\wyu\\\\\o\\\\f000\0\eng\d,both
1,100000715,01835cam a2200445Ia 4500,070329s2007\\\\mdu\\\\\o\\\\f000\0\eng\\,b170354271,w,02357cam a2200481 a 4500,070329s2007\\\\mdu\\\\\o\\\\f000\0\eng\\,both
2,1000028314,NaN,NaN,NaN,NaN,02136cai a2200505 i 4500,170808c201u9999mdu\x\w\o\\\\f0\\\\2eng\c,right_only
3,1000043130,NaN,NaN,NaN,NaN,04257cam a2200721 i 4500,170808e200012\\ncua\\\\obt\\f000\0\eng\c,right_only
4,1000048890,02481cam a2200493 i 4500,170808s2017\\\\dcu\\\\\ob\\\f000\0\eng\c,b21348707x,w,03069cam a2200589 i 4500,170808s2017\\\\dcu\\\\\ob\\\f000\0\eng\c,both

In [43]:
bdf = df[df["_merge"] == "both"]

In [44]:
bdf.shape[0]

153073

In [45]:
bdf.head()

,oclcNo,leader_x,t008_x,bibNo,matType,leader_y,t008_y,_merge
0,100000459,02200cam a2200445Ka 4500,070329s2007\\\\wyu\\\\\o\\\\f000\0\eng\d,b165487732,w,02938cam a2200565 a 4500,070329s2007\\\\wyu\\\\\o\\\\f000\0\eng\d,both
1,100000715,01835cam a2200445Ia 4500,070329s2007\\\\mdu\\\\\o\\\\f000\0\eng\\,b170354271,w,02357cam a2200481 a 4500,070329s2007\\\\mdu\\\\\o\\\\f000\0\eng\\,both
4,1000048890,02481cam a2200493 i 4500,170808s2017\\\\dcu\\\\\ob\\\f000\0\eng\c,b21348707x,w,03069cam a2200589 i 4500,170808s2017\\\\dcu\\\\\ob\\\f000\0\eng\c,both
5,1000048894,02318cam a2200529 i 4500,170808s2017\\\\dcua\\\\ob\\\f000\0\eng\c,b213487081,w,02938cam a2200637 i 4500,170808s2017\\\\dcua\\\\ob\\\f000\0\eng\c,both
6,1000049067,02604cam a2200517 i 4500,170808s2017\\\\dcu\\\\\o\\\\f000\0\eng\c,b21348710x,w,04062cam a2200709 i 4500,170808s2017\\\\dcu\\\\\o\\\\f000\0\eng\c,both

In [46]:
sierra_eres = df[(df["matType"] == "w") & (df["_merge"] == "left_only")]

In [47]:
sierra_eres.shape[0]

42441

In [48]:
sierra_eres.head()

,oclcNo,leader_x,t008_x,bibNo,matType,leader_y,t008_y,_merge
28,1000055813,02659cam a2200469 i 4500,170808s2001\\\\dcua\\\\o\\\\f001\0\eng\c,b213487408,w,NaN,NaN,left_only
76,1000155993,01816cam a2200421 i 4500,170809s2013\\\\dcua\\\\ob\\\f000\0\eng\c,b213487767,w,NaN,NaN,left_only
90,1000174735,02305cam a2200517 i 4500,170809s2013\\\\caua\\\\ob\\\f000\0\eng\c,b213488644,w,NaN,NaN,left_only
166,1000387815,02842cai a2200565Ii 4500,170811c199u9999dcu\x\w\o\\\\f0\\\\2eng\d,b214167938,w,NaN,NaN,left_only
249,100123824,02099nam a2200517 a 4500,070329s2007\\\\dcu\\\\\\\\\\f000\0\eng\c,b165488529,w,NaN,NaN,left_only

In [49]:
sierra_eres.tail()

,oclcNo,leader_x,t008_x,bibNo,matType,leader_y,t008_y,_merge
369706,99940450,01594cam a2200409Ka 4500,070328s2006\\\\mdu\\\\\o\\\\f000\0\spa\d,b165486120,w,NaN,NaN,left_only
369741,999610164,02567nam a2200505 i 4500,170804s2014\\\\caub\\\\o\\\\f000\0\eng\c,b213488826,w,NaN,NaN,left_only
369766,99964260,01701cam a2200421Ka 4500,070328s2007\\\\mdu\\\\\o\\\\f000\0\spa\d,b165486855,w,NaN,NaN,left_only
369789,999728793,02085nam a2200481 i 4500,170807s2017\\\\dcu\\\\\ob\\\f000\0\eng\c,b219699112,w,NaN,NaN,left_only
369829,99996749,02402nam a22005414a 4500,070402s2006\\\\dcu\\\\\\\\\\f000\0\eng\c,b165488669,w,NaN,NaN,left_only

In [50]:
oclc_only = df[df["_merge"] == "right_only"]

In [51]:
oclc_only.shape[0]

29612

In [52]:
oclc_only.head()

,oclcNo,leader_x,t008_x,bibNo,matType,leader_y,t008_y,_merge
2,1000028314,NaN,NaN,NaN,NaN,02136cai a2200505 i 4500,170808c201u9999mdu\x\w\o\\\\f0\\\\2eng\c,right_only
3,1000043130,NaN,NaN,NaN,NaN,04257cam a2200721 i 4500,170808e200012\\ncua\\\\obt\\f000\0\eng\c,right_only
23,1000054626,NaN,NaN,NaN,NaN,02989cam a2200637 i 4500,170808s2015\\\\oruab\\\o\\\\f000\0\eng\c,right_only
32,1000056457,NaN,NaN,NaN,NaN,03200cam a2200685 i 4500,170808s2002\\\\ncuabd\\ob\\\f000\0\eng\c,right_only
38,1000102944,NaN,NaN,NaN,NaN,04240cam a2200721 i 4500,170808s2017\\\\dcua\\\\o\\\\f000\0\eng\d,right_only